grpc-30tps-results.txt
🧪 Running K6 Performance Tests on GKE...
🔍 Checking if rest-grpc-service is ready...
NAME                TYPE           CLUSTER-IP      EXTERNAL-IP    PORT(S)                         AGE
rest-grpc-service   LoadBalancer   34.118.226.27   34.129.198.4   8080:31787/TCP,6565:31678/TCP   62m
⏳ Waiting for external IP...
🌐 External IP obtained: 34.129.198.4
🔍 Testing service connectivity...
✅ Service is responding!
🏥 Service Health Check:
{
  "status": "UP",
  "components": {
    "camelHealth": {
      "status": "UP",
      "details": {
        "name": "camel-health-check",
        "context": "UP",
        "context.data": {
          "context.phase": "5",
          "context.name": "camel-1",
          "context.version": "4.4.0",
          "context.status": "Started",
          "check.kind": "ALL"
        }
      }
    },
    "camelLivenessState": {
      "status": "UP"
    },
    "camelReadinessState": {
      "status": "UP"
    },
    "db": {
      "status": "UP",
      "details": {
        "database": "H2",
        "validationQuery": "isValid()"
      }
    },
    "diskSpace": {
      "status": "UP",
      "details": {
        "total": 137140670464,
        "free": 128351899648,
        "threshold": 10485760,
        "path": "/app/.",
        "exists": true
      }
    },
    "livenessState": {
      "status": "UP"
    },
    "ping": {
      "status": "UP"
    },
    "readinessState": {
      "status": "UP"
    }
  },
  "groups": [
    "liveness",
    "readiness"
  ]
}
🚀 Starting REST Performance Test...
job.batch/k6-rest-ramp-loadtest-gke created
⏳ Waiting for REST test to complete...
job.batch/k6-rest-ramp-loadtest-gke condition met
✅ REST test completed!
📊 REST Test Results:

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6-rest-cluster.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 50s max duration (incl. graceful stop):
              * default: 10 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 31 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  01.0s/20s

running (02.0s), 10/10 VUs, 67 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  02.0s/20s

running (03.0s), 10/10 VUs, 103 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  03.0s/20s

running (04.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  04.0s/20s

running (05.0s), 10/10 VUs, 198 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  05.0s/20s

running (06.0s), 10/10 VUs, 246 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  06.0s/20s

running (07.0s), 10/10 VUs, 302 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  07.0s/20s

running (08.0s), 10/10 VUs, 315 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  08.0s/20s

running (09.0s), 10/10 VUs, 326 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  09.0s/20s

running (10.0s), 10/10 VUs, 364 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  10.0s/20s

running (11.0s), 10/10 VUs, 428 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  11.0s/20s

running (12.0s), 10/10 VUs, 465 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  12.0s/20s

running (13.0s), 10/10 VUs, 521 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  13.0s/20s

running (14.0s), 10/10 VUs, 533 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  14.0s/20s

running (15.0s), 10/10 VUs, 554 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  15.0s/20s

running (16.1s), 10/10 VUs, 565 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  16.1s/20s

running (17.2s), 10/10 VUs, 580 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  17.2s/20s

running (18.2s), 10/10 VUs, 582 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  18.2s/20s

running (19.0s), 10/10 VUs, 591 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  19.0s/20s

running (20.0s), 10/10 VUs, 649 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  20.0s/20s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=760.76ms

    http_req_failed
    ✓ 'rate<0.1' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 1318   65.522043/s
    checks_succeeded...................: 95.06% 1253 out of 1318
    checks_failed......................: 4.93%  65 out of 1318

    ✓ status was 200
    ✗ response time < 500ms
      ↳  90% — ✓ 594 / ✗ 65

    HTTP
    http_req_duration.......................................................: avg=165.3ms  min=5.29ms   med=46.11ms  max=2.86s p(90)=488.9ms  p(95)=760.76ms
      { expected_response:true }............................................: avg=165.3ms  min=5.29ms   med=46.11ms  max=2.86s p(90)=488.9ms  p(95)=760.76ms
    http_req_failed.........................................................: 0.00%  0 out of 659
    http_reqs...............................................................: 659    32.761022/s

    EXECUTION
    iteration_duration......................................................: avg=304.38ms min=105.81ms med=168.11ms max=2.96s p(90)=696.67ms p(95)=993.74ms
    iterations..............................................................: 659    32.761022/s
    vus.....................................................................: 10     min=10       max=10
    vus_max.................................................................: 10     min=10       max=10

    NETWORK
    data_received...........................................................: 187 kB 9.3 kB/s
    data_sent...............................................................: 145 kB 7.2 kB/s



running (20.1s), 00/10 VUs, 659 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  20s
🧹 Cleaning up REST test job...
job.batch "k6-rest-ramp-loadtest-gke" deleted
⏸️  Waiting 30 seconds before next test...
🚀 Starting gRPC Performance Test...
job.batch/k6-grpc-ramp-loadtest-gke created
⏳ Waiting for gRPC test to complete...